In [1]:
import pandas as pd

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [9]:
df1.shape

(7, 3)

In [11]:
print('we have number of raws is =', df1.shape[0])
print('we have number of column is =', df1.shape[1])

we have number of raws is = 7
we have number of column is = 3

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [15]:
df1.dtypes

Name      object
Marks      int64
Gender    object
dtype: object

In [23]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [35]:
df1.describe(include = 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [37]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [39]:
df1['Gender'].nunique()

2

In [41]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [47]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [45]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [51]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [53]:
#using between method 
df1['Marks'].between(90,100) # both 90 and 100 are inclusive

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [55]:
sum(df1['Marks'].between(90,100))

4

In [57]:
df1['Marks'].mean()

92.14285714285714

In [69]:
def marks (x):
    return x//2

In [71]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [73]:
df1['Half_Marks']= df1['Marks'].apply(marks)

In [75]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [85]:
df1['Marks'].apply(lambda x:x//2) #simple func ma 4 line of code and lambda func ma 1 line ma

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [87]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [97]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [99]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [101]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [103]:
df1.drop(['Half_Marks','Male_Female'],axis=1,inplace=True)

In [105]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [107]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [109]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [119]:
df1.sort_values(by=['Marks','Gender'],ascending=False, inplace=True)

In [121]:
df1

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [133]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
2   Krisha     99
6  Archana     99
1   Aadhya     89
5   Mittal     83

In [135]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
2   Krisha     99
6  Archana     99
1   Aadhya     89
5   Mittal     83